Revit 2026 API

# DocumentGetElement(Reference) Method

---

Gets the Element referenced by the input reference.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public Element GetElement(
	Reference reference
)
```
```vb
Public Function GetElement (
	reference As Reference
) As Element
```
```cpp
public:
Element^ GetElement(
	Reference^ reference
)
```
```fsharp
member GetElement :
        reference : Reference -> Element
```

#### Parameters

reference Reference
     The reference, whose referenced Element will be retrieved from the model.

#### Return Value

Element The element referenced by the input argument.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

will be returned if the input reference doesn't reference to a valid Element.

#### Reference

Document Class

GetElement Overload

Autodesk.Revit.DB Namespace